In [1]:
from bs4 import BeautifulSoup
import requests
from splinter import Browser
import pandas as pd

In [2]:
edu_data_url = "https://www.experian.com/blogs/ask-experian/state-of-student-loan-debt/#s6"

In [184]:
student_loan_data = pd.read_html(edu_data_url)
# student_loan_data

In [192]:
student_loan_debt_since_09 = student_loan_data[0]
student_loan_debt_since_09 = student_loan_debt_since_09.rename(columns={"Student Loan Debt Since 2009(in trillions)": "Year",
                                 "Unnamed: 1": "Amount(in trillions)"})

# student_loan_debt_since_09.head()

In [193]:
student_loan_debt_since_09 = student_loan_debt_since_09[student_loan_debt_since_09.columns[0:]]\
    .replace('[\$,%]', '', regex=True).apply(pd.to_numeric) 
student_loan_debt_since_09.dtypes

Year                      int64
Amount(in trillions)    float64
dtype: object

In [194]:
student_loan_debt_since_09.head()

   Year  Amount(in trillions)
0  2019                  1.41
1  2018                  1.33
2  2017                  1.28
3  2016                  1.17
4  2015                  1.13

In [229]:
student_loan_debt_since_09.to_csv('clean_data/stu_loan_debt_since_09.csv', index=True)

In [225]:
us_debt_bal_by_type = student_loan_data[1]
us_debt_bal_by_type = us_debt_bal_by_type.rename(columns={"U.S. Consumer Debt Balances by Credit Product(in trillions)": "Loan Type", 
                                                          "Unnamed: 1": "Amount (in trillions)"})
us_debt_bal_by_type

           Loan Type Amount (in trillions)
0           Mortgage                 $9.52
1       Student Loan                 $1.41
2  Auto Loan & Lease                 $1.28
3        Credit Card                  $.81
4      Personal Loan                  $.30
5        Retail Card                  $.09

In [227]:
us_debt_bal_by_type.to_csv('clean_data/us_debt_bal_by_type.csv', index=True)

In [198]:
sl_debt_snapshot = student_loan_data[2]
sl_debt_snapshot = sl_debt_snapshot.rename(columns={"Student Loan Debt Snapshot": "Details", 
                                "Unnamed: 1": "Amount"})
sl_debt_snapshot

                                             Details         Amount
0             Average student loan debt per borrower        $35,359
1                            Total student loan debt  $1.4 trillion
2        Percentage of consumers with a student loan          14.4%
3  Washington, D.C., had the highest average stud...        $55,882
4  South Dakota had the lowest average student lo...        $28,868
5  Average tuition and fees for a public four-yea...        $10,230
6  Average tuition and fees for a public four-yea...        $26,290
7  Average tuition for a private nonprofit four-y...        $35,830

In [228]:
sl_debt_snapshot.to_csv('clean_data/stu_loan_debt_snapshot.csv', index=True)

In [199]:
avg_sl_debt_by_state = student_loan_data[3]
# avg_sl_debt_by_state.head()

In [67]:
# avg_sl_debt_by_state.to_csv("Average Student Loan Debt by State.csv")

In [200]:
avg_sl_debt_by_state = pd.read_csv('Average Student Loan Debt by State.csv')
avg_sl_debt_by_state.columns

Index(['Unnamed: 0', 'State', '2018', '2019', '% Change'], dtype='object')

In [201]:
avg_sl_debt_by_state = avg_sl_debt_by_state.drop(columns=['Unnamed: 0'])

In [202]:
avg_sl_debt_by_state = avg_sl_debt_by_state[avg_sl_debt_by_state.columns[0:]]\
    .replace('[\$,%]', '', regex=True)

In [203]:
avg_sl_debt_by_state[['2018', '2019', '% Change']]\
            = avg_sl_debt_by_state[['2018', '2019', '% Change']].apply(pd.to_numeric) 
avg_sl_debt_by_state.dtypes

State        object
2018        float64
2019        float64
% Change    float64
dtype: object

In [204]:
avg_sl_debt_by_state.head()

        State     2018     2019  % Change
0     Alabama  33742.0  35674.0       5.7
1      Alaska  30085.0  32096.0       6.7
2     Arizona  32705.0  34740.0       6.2
3    Arkansas  30345.0  32203.0       6.1
4  California  35238.0  37468.0       6.3

In [215]:
avg_sl_debt_by_state.to_csv('clean_data/avg_sl_debt_by_state.csv', index=True)

In [205]:
avg_debt_by_metro_area = student_loan_data[4]
# avg_debt_by_metro_area.head()

In [148]:
# avg_debt_by_metro_area.to_csv('avg_debt_by_metro_area.csv', index=True)

In [206]:
avg_debt_by_metro_area = pd.read_csv('avg_debt_by_metro_area.csv')
# avg_debt_by_metro_area.head()

In [207]:
avg_debt_by_metro_area = avg_debt_by_metro_area.drop(columns=['Unnamed: 0'])

In [208]:
avg_debt_by_metro_area = avg_debt_by_metro_area[avg_debt_by_metro_area.columns[0:]]\
    .replace('[\$,%]', '', regex=True)
avg_debt_by_metro_area[['Rank', '2018', '2019', '% Change']]\
            = avg_debt_by_metro_area[['Rank', '2018', '2019', '% Change']].apply(pd.to_numeric) 
avg_debt_by_metro_area.dtypes

Rank            int64
Metro Area     object
2018            int64
2019            int64
% Change      float64
dtype: object

In [212]:
avg_debt_by_metro_area.head()

   Rank                 Metro Area   2018   2019  % Change
0     1                  Durham NC  43614  47955      10.0
1     2                Corvalis OR  42976  46164       7.4
2     3               Ann Arbor MI  43182  45668       5.8
3     4  Santa Cruz-Watsonville CA  43599  45396       4.1
4     5             Gainesville FL  40221  44508      10.7

In [214]:
avg_debt_by_metro_area.to_csv('clean_data/avg_debt_by_metro_area.csv', index=True)